app/controllers/todo_lists_controller.rb

  def create

    @user = current_user
    @todo_list = @user.todo_lists.build(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["description", ""], ["created_at", "2020-03-24 16:34:50.034909"], ["updated_at", "2020-03-24 16:34:50.034909"]]