sample 1/app/controllers/todo_lists_controller.rb

INSERT INTO "todo_lists" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hello "], ["description", "1"], ["user_id", 1], ["created_at", "2020-03-26 09:33:14.619118"], ["updated_at", "2020-03-26 09:33:14.619118"]]
---
  def create

    @user = current_user
    @todo_list = @user.todo_lists.build(todo_list_params)

    respond_to do |format|
      if @todo_list.save